#include<stdio.h>
void main(){
	// &&,|| 2개면 참거짓 다루는거,
	// &,|  1개면 계산
	float i;
	int j,k,m;
	int v1 = 1;
	int v2 = 2;
	// 100 나누기 300= 0 (int 정수값으로)
	i = 100/300;
	// v1=1이고, 2진수로 하면 0001
	// v2=2이고, 2진수로 하면 0010
	// v1&v2 이면 0001 x 0010 = 0000 = 0
	j = v1 & v2;
	// v1|v2 이면 0001 + 0010 = 0011 = 3
	k = v1|v2;
	// j && k = 0000 && 0011 = 거짓
	// 거짓 || i = 0 (거짓) = 거짓 이므로 else문으로 이동
	if(j && k || i) m = i+j;
	// j+k = 0+3 = 3
	else m = j+k;
	
	// 0,0  , 0, 3, 003
	printf("i = %.1f, j=%d, k=%d, m=%03d\n", i,j,k,m);
}